import java.util.*;

public class A1113363_0421_2{
    public static void main(String[] argv) {
        Scanner sc = new Scanner(System.in);
        System.out.println("請以YYYY/MM/DD輸入日期");

        String str = sc.nextLine();
        String date = "(((19|20)\\d{2})/(0?[13578]|1[02])/(0?[1-9]|[12]\\d|3[01]))|(((19|20)\\d{2})/(0?[469]|11)/(0?[1-9]|[12]\\d|30))|(((19|20)\\d{2})/0?2/(0?[1-9]|1\\d|2[0-8]))";
        if (str.matches(date)){
            System.out.println(str);
        }else {
            System.out.println("格式錯誤");
        }
    }
}


/*正則表示法拆解
 * 年分:((19|20)\d{2})
 * 有31天的月份:(0?[13578] | 1[02])
 * 有31天的日期:(0?[1-9] | [12]\d | 3[01])
 * 綜合:((19|20)\\d{2})/(0?[13578]|1[02])/(0?[1-9]|[12]\\d|3[01]))
 * 有30天的月份:(0?[469] | 11)
 * 有30天的日期:(0?[1-9] | [12]\d | 30)
 * 綜合:((19|20)\\d{2})/(0?[469]|11)/(0?[1-9]|[12]\\d|30)
 * 二月份:0?2 
 * 二月份日期:(0?[1-9]|1\\d|2[0-8])
*/